Revit 2024 API
AssetPropertyBoolean Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyBoolean : AssetProperty
Visual Basic
Public Class AssetPropertyBoolean _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyBoolean : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyBoolean
See Also
AssetPropertyBoolean Members
Autodesk.Revit.DB.Visual Namespace